Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །བཅོམ་ལྡན་འདས་ཆོས་གང་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་དང་། གང་གིས་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་དང་། གང་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བགྱི་བ་དེ་ལྟ་བུའི་ཆོས་ཀྱང་བདག་གིས་ཡང་དག་པར་རྗེས་སུ་མ་མཐོང་ངོ་། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, I cannot observe anyone who will attain consummate buddhahood, anything through which consummate buddhahood will be attained, or even anything that will constitute consummate buddhahood.” “

source: ཆོས་ཐམས་ཅད་མི་དམིགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི། འདི་སྙམ་དུ་བདག་ནི་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ།
en: Bodhisattva great beings who do not apprehend anything do not think, ‘I will attain consummate buddhahood.

source: །འདིས་ནི་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱའོ།
en: Through this consummate buddhahood will be attained.

source: །འདི་ནི་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱའོ་ཞེས་བྱ་བར་མི་སེམས་སོ།
en: This will constitute the attainment of consummate buddhahood.’

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་དེ་ནི་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་རྣམ་པར་རྟོག་པ་དེ་དག་ཐམས་ཅད་མེད་པའི་ཕྱིར་ཏེ།
en: If you ask why, Subhūti, it is because bodhisattva great beings who practice the perfection of wisdom are without all those conceptual thoughts.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ནི་རྣམ་པར་མི་རྟོག་པའོ།
en: If you ask why, Subhūti, it is because the perfection of wisdom is nonconceptual.”

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ་ལས། ལེའུ་བཞི་བཅུ་ལྔ་པའོ།། །།དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ།
en: This completes the forty-fifth chapter from “The Perfection of Wisdom in Twenty-Five Thousand Lines.”

source: །བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ནི་ཤིན་ཏུ་དབེན་པའི་སླད་དུ་ཟབ་པའོ། །བལྟ་དཀའ་བའོ། །རྟོགས་པར་དཀའ་བའོ། །བརྟག་ཏུ་མ་མཆིས་པའོ། །བརྟག་པའི་སྤྱོད་ཡུལ་མ་ལགས་པའི་ཞི་བ་ཕྲ་བ་ཞི་བ་བའོ།
en: Chapter 46 Then, Śakra, mighty lord of the gods, said to the Blessed One, “Blessed Lord, the perfection of wisdom, owing to its extreme voidness, is profound; it is hard to see, hard to realize, inscrutable, not within the perceptual range of ideation, at peace, subtle, and delicate.

source: །མཁས་ཤིང་རིག་པས་རྟོགས་པར་བགྱི་བའོ།
en: It is to be realized through learning and awareness.

source: །བཅོམ་ལྡན་འདས་སེམས་ཅན་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ཉན་ཅིང་འཛིན་པ་དང་། འཆང་ཞིང་ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བགྱིད་པ་དང་། དེ་བཞིན་ཉིད་དུ་ནན་ཏན་བགྱིད་ཅིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་སངས་རྒྱས་ཀྱི་བར་དུ། སེམས་དང་སེམས་ལས་བྱུང་བའི་ཆོས་གཞན་གྱི་གོ་མི་འབྱེད་པ་དེ་དག་ནི།
en: Blessed Lord, those beings who hear, take up, uphold, recite, and master this profound perfection of wisdom, and are earnestly intent on the real nature, and who offer no opportunity for other phenomena, including mind and mental states, [to intrude] until they have attained consummate buddhahood in unsurpassed, complete enlightenment, are not endowed with inferior roots of virtue.” “

source: དགེ་བའི་རྩ་བ་ཐ་མ་དང་ལྡན་པ་མ་ལགས་སོ།
en: Kauśika, it is so!

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་དེ་དེ་བཞིན་ནོ། །དེ་དེ་བཞིན་ཏེ། སེམས་ཅན་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ཉན་ཅིང་འཛིན་པ་དང་།
en: It is so,” replied the Blessed One. “

source: འཆང་ཞིང་ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། དེ་བཞིན་ཉིད་དུ་ནན་ཏན་བྱེད་ཅིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཀྱི་བར་དུ། སེམས་དང་སེམས་ལས་བྱུང་བའི་ཆོས་གཞན་གྱི་གོ་མི་འབྱེད་པ་དེ་དག་ནི། དགེ་བའི་རྩ་བ་ཐ་མ་དང་ལྡན་པ་མ་ཡིན་ནོ།
en: Those beings who hear, take up, uphold, recite, and master this profound perfection of wisdom, and are earnestly intent on the real nature, and who offer no opportunity for other phenomena, including mind and mental states, [to intrude] until they have attained consummate buddhahood in unsurpassed, complete enlightenment, are not endowed with inferior roots of virtue.

source: །ཀཽ་ཤི་ཀ་དེ་ཇི་སྙམ་དུ་སེམས། འཛམ་བུའི་གླིང་གི་སེམས་ཅན་གང་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དང་ལྡན་པར་གྱུར།
en: Kauśika, if all the beings of Jambudvīpa, as many as there are, {Ki.

source: བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པར་གྱུར་ལ། རིགས་ཀྱི་བུ་འམ་རིགས་ཀྱི་བུ་མོ་ལ་ལ་ཞིག་ཀྱང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་འཛིན་ཅིང་འཆང་ལ། ཀློག་ཅིང་ཀུན་ཆུབ་པར་བྱེད་པར་གྱུར་ཏེ། བཟུང་ཞིང་བཅངས་ཏེ། བླགས་ཤིང་ཀུན་ཆུབ་པར་བྱས་ནས་ཀྱང་། དེ་བཞིན་ཉིད་དུ་ནན་ཏན་བྱེད་ན། ཀཽ་ཤི་ཀ་དགེ་བའི་རྩ་བ་འདི་ལ་སྔ་མའི་དགེ་བའི་རྩ་བ་དེས་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོའོ། །སྟོང་གི་ཆ་དང་།
en: V: 20} were endowed with the paths of the ten virtuous actions, and endowed with the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, and the five extrasensory powers, and if there were a noble son or noble daughter who held, maintained, recite, and mastered this perfection of wisdom, and after holding, maintaining, reciting, and mastering it, were to be earnestly intent upon the real nature, in that case, Kauśika, the roots of virtuous action of the former would come nowhere near even a hundredth part of this root of virtue [of that son or noble daughter].

source: བརྒྱ་ཕྲག་སྟོང་གི་ཆ་དང་། བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་གི་བར་གྱི་ཆ་དང་། གྲངས་དང་། ཆ་དང་། བགྲང་བ་དང་། དཔེ་དང་། རྒྱུར་ཡང་མི་བཟོད་དོ།
en: Nor would they be accepted as even a thousandth part, a hundred thousandth part, a hundred billion trillionth part, or any number, fraction, categorization, comparison, or comparable quality!”

source: །དེ་ནས་དགེ་སློང་གཅིག་ཅིག་གིས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །ཀཽ་ཤི་ཀ་འཛམ་བུ་གླིང་གི་སེམས་ཅན་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དང་ལྡན་པ། བསམ་གཏན་བཞི་དང་ལྡན་པ། ཚད་མེད་པ་བཞི་དང་ལྡན་པ། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་ལྡན་པ། མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ། དེ་དག་ཐམས་ཅད་ནི་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་མི་གཡེང་བའི་སེམས་ཀྱིས་འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དང་། དེ་བཞིན་ཉིད་དུ་ནན་ཏན་བྱེད་ཅིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཀྱི་བར་དུ། སེམས་དང་སེམས་ལས་བྱུང་བའི་ཆོས་གཞན་གྱི་གོ་མི་འབྱེད་པ་དེ་དག་གིས་ཟིལ་གྱིས་ནོན་ཏོ། །དེ་སྐད་ཅེས་སྨྲས་པ་དང་།
en: Thereupon, a certain monk said to Śakra, mighty lord of the gods, “Kauśika, all those beings of Jambudvīpa who are endowed with the paths of the ten virtuous actions, and endowed with the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, and the five extrasensory powers, will be outshone by those noble sons or noble daughters who hold, maintain, recite, and master this profound perfection of wisdom, focusing their attention correctly on it, and who are earnestly intent on the real nature, offering no opportunity for other phenomena, including mind and mental states, [to intrude] until they have attained consummate buddhahood in unsurpassed, complete enlightenment.”

source: ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས། དགེ་སློང་དེ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །དགེ་སློང་འཛམ་བུ་གླིང་གི་སེམས་ཅན་དགེ་བ་བཅུའི་ལས་ཀྱི་ལམ་དང་ལྡན་པ། བསམ་གཏན་བཞི་དང་ལྡན་པ། ཚད་མེད་པ་བཞི་དང་ལྡན་པ། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་ལྡན་པ། མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ། དེ་དག་ཐམས་ཅད་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དང་ལྡན་པའི་སེམས་དང་པོ་བསྐྱེད་པས་ཀྱང་ཟིལ་གྱིས་ནོན་ན། གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་། ཀུན་ཆུབ་པར་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དང་། བཟུང་ཞིང་བཅངས་ཏེ།
en: Śakra, mighty lord of the gods, replied to that monk, “If, O monk, all those beings of Jambudvīpa who are endowed with the paths of the ten virtuous actions, and endowed with the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, and the five extrasensory powers, will be outshone even by bodhisattva great beings who have given rise for the first time to the mind set on all-aspect omniscience, what more need one say about those who take up, uphold, recite, and master this profound perfection of wisdom, focusing their attention correctly on it, and who, even after taking up, upholding, reciting, and mastering it, are earnestly intent on the real nature.

source: བླགས་ཤིང་ཀུན་ཆུབ་པར་བྱས་ནས་ཀྱང་། དེ་བཞིན་ཉིད་དུ་ནན་ཏན་བྱེད་པ་ལྟ་སྨོས་ཀྱང་ཅི་དགོས་ཏེ། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་ནོན་པར་འགྱུར་ཏེ།
en: They will outshine the world with its gods, humans, and asuras.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེས་ནི་ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཅིང་འགྲོ་བར་འགྱུར་རོ། །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ལྷ་དང་། མི་དང་།
en: That is to say, those bodhisattva great beings will come to outshine the world with its gods, humans, and asuras.

source: ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་མནན་ཅིང་འགྲོ་བར་ཡང་མ་ཟད་དེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་རྒྱུན་ཏུ་ཞུགས་པ་དང་། ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པ་དང་། རང་སངས་རྒྱས་གང་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཟིལ་གྱིས་མནན་ཅིང་འགྲོ་བར་འགྱུར་རོ།
en: Not only will those bodhisattva great beings come to outshine the world with its gods, humans, and asuras, those bodhisattva great beings will also come to outshine all those who have entered the stream to nirvāṇa, who are destined for only one more rebirth, who are no longer subject to rebirth, who have attained arhatship, and who have attained individual enlightenment.

source: །རྒྱུན་ཏུ་ཞུགས་པ་དང་། ལན་ཅིག་ཕྱིར་འོང་བ་དང་། ཕྱིར་མི་འོང་བ་དང་། དགྲ་བཅོམ་པ་དང་། རང་སངས་རྒྱས་སུ་ཡང་མ་ཟད་དོ།
en: This will not only apply to those who have entered the stream to nirvāṇa, who are destined for only one more rebirth, who are no longer subject to rebirth, who have attained arhatship, and who have attained individual enlightenment.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ། ཐབས་མཁས་པ་དང་བྲལ་བ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བྲལ་བ་དེ་དག་ཀྱང་ཟིལ་གྱིས་གནོན་ཅིང་འགྲོ་བར་འགྱུར་རོ།
en: For those bodhisattva great beings will also come to outshine [other] bodhisattva great beings who practice the perfection of generosity without skill in means and without the perfection of wisdom.

source: །སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པར་ཡང་མ་ཟད་དེ།
en: And this will apply not only to those who practice the perfection of generosity, {Ki.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ། ཐབས་མཁས་པ་དང་བྲལ་བ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་བྲལ་བ། དེ་དག་ཀྱང་ཟིལ་གྱིས་གནོན་ཅིང་འགྲོ་བར་འགྱུར་རོ།
en: V: 21} for those bodhisattva great beings will also come to outshine bodhisattva great beings who practice the perfection of ethical discipline without skill in means and without the perfection of wisdom.

source: །ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པར་ཡང་མ་ཟད་དེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ། ཐབས་མཁས་པ་དང་བྲལ་བ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་བྲལ་བ་གང་ཇི་སྙེད་པ་དེ་དག་ཀྱང་ཟིལ་གྱིས་གནོན་ཅིང་འགྲོ་བར་འགྱུར་རོ།
en: And this will apply not only to those who practice the perfection of ethical discipline, for those bodhisattva great beings will also come to outshine all the many bodhisattva great beings who practice the perfection of tolerance without skill in means and without the perfection of wisdom.

source: །བཟོད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པར་ཡང་མ་ཟད་དེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ། ཐབས་མཁས་པ་དང་བྲལ་བ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་བྲལ་བ་གང་ཇི་སྙེད་པ་དེ་དག་ཀྱང་ཟིལ་གྱིས་གནོན་ཅིང་འགྲོ་བར་འགྱུར་རོ།
en: And this will apply not only to those who practice the perfection of tolerance, for those bodhisattva great beings will also come to outshine all the many bodhisattva great beings who practice the perfection of perseverance without skill in means and without the perfection of wisdom.

source: །བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པར་ཡང་མ་ཟད་དེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པ། ཐབས་མཁས་པ་དང་བྲལ་བ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་བྲལ་བ་གང་ཇི་སྙེད་པ་དེ་དག་ཀྱང་ཟིལ་གྱིས་གནོན་ཅིང་འགྲོ་བར་འགྱུར་རོ།
en: And this will apply not only to those who practice the perfection of perseverance, for those bodhisattva great beings will also come to outshine all the many bodhisattva great beings who practice the perfection of meditative concentration without skill in means and without the perfection of wisdom.

source: །བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པར་ཡང་མ་ཟད་དེ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཇི་སྐད་དུ་བསྟན་པ་བཞིན་དུ་སྤྱོད་པ་དེ་དག་ནི། ལྷ་དང་། མི་དང་། ལྷ་མ་ཡིན་དུ་བཅས་པའི་འཇིག་རྟེན་ཟིལ་གྱིས་གནོན་པར་མི་ནུས་སོ།
en: And this will apply not only to those who practice the perfection of meditative concentration, for those bodhisattva great beings who practice the perfection of wisdom, as it has been revealed, cannot be outshone by the world with its gods, humans, and asuras.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དེ་དག་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་ཇི་སྐད་དུ་བསྟན་པ་དང་འཐུན་པར་སྤྱོད་པ་སྟེ།
en: Bodhisattva great beings who practice the perfection of wisdom practice in harmony with the perfection of wisdom, as it has been revealed.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་རིགས་རྒྱུན་མི་གཅད་པའི་དོན་དུ་གནས་པའོ།
en: Those bodhisattva great beings are established so that the lineage of all-aspect omniscience will not be interrupted.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་དེ་བཞིན་གཤེགས་པ་རིང་དུ་མི་བྱེད་དོ།
en: Those bodhisattva great beings are not remote from the tathāgatas.

source: །དེ་ལྟར་ཞུགས་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་སྙིང་པོ་བྱང་ཆུབ་དང་འཕྲད་པར་མི་འགྱུར་རོ།
en: Those bodhisattva great beings who enter in that manner will not be estranged from the site of enlightenment.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་སེམས་ཅན་བྱིང་བ་རྣམས་གདོན་པར་འདོད་པའོ།
en: Those bodhisattva great beings will wish to extricate beings immersed in the mire [of afflicted mental states].

source: །དེ་ལྟར་སློབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའི་བསླབ་པ་ལ་སློབ་པ་སྟེ།
en: Bodhisattva great beings who train in that manner undertake the training of the bodhisattvas.

source: ཉན་ཐོས་ཀྱི་བསླབ་པ་ལ་སློབ་པ་མ་ཡིན་ནོ། །རང་སངས་རྒྱས་ཀྱི་བསླབ་པ་ལ་སློབ་པ་མ་ཡིན་ནོ།
en: They do not undertake the training of the śrāvakas, and they do not undertake the training of the pratyekabuddhas. “

source: །དེ་ལྟར་སློབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དྲུང་དུ་རྒྱལ་པོ་ཆེན་པོ་བཞི་དག་ཀྱང་འགྲོ་བར་བྱ་བར་སེམས་ཏེ།
en: The Four Great Kings will also think of approaching bodhisattva great beings who train in that manner.

source: ཉེ་བར་འདོང་ཞིང་འདི་སྐད་ཅེས་སྨྲའོ། །ཀྱེ་སྐྱེས་བུ་ཆེན་པོ་མྱུར་དུ་སློབས་ཤིག །
en: Drawing near, they will say and point out, ‘Train swiftly, great one!

source: སྐྱེས་བུ་ཆེན་པོ་སྐྱེན་པར་སློབས་ཤིག །
en: Train nimbly, great one!

source: ལྷུང་བཟེད་བཞི་པོ་འདི་དག་ནི་ཁྱོད་ཀྱིས་སྙིང་པོ་བྱང་ཆུབ་ཏུ་འདུག་སྟེ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་བླང་བར་བྱ་བ་སྟེ།
en: You shall receive these four alms bowls when you are seated at the site of enlightenment, having attained consummate buddhahood in unsurpassed, complete enlightenment.

source: འདི་དག་ནི་སྔོན་གྱི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཀྱིས་བཞེས་པའོ་ཞེས་ཟེར་ཞིང་སྟོན་ཏོ།
en: These have been received by the tathāgatas, arhats, completely awakened buddhas of the past.’

source: །དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་དྲུང་དུ་རྒྱལ་པོ་ཆེན་པོ་བཞི་དག་ཀྱང་། རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷའི་བུ་རྣམས་དང་ལྷན་ཅིག་འདོང་བར་སེམས་སོ།
en: The Four Great Kings, along with the gods of Caturmahā­rāja­kāyika, will also think of approaching bodhisattva great beings who practice the perfection of wisdom in that manner.

source: །དེའི་དྲུང་དུ་བདག་ཀྱང་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷའི་བུ་རྣམས་དང་ལྷན་ཅིག་འགྲོ་བར་སེམས་སོ།
en: I, too, along with the gods of Trayastriṃśa, will think of approaching them.

source: །ལྷའི་རྒྱལ་པོ་རབ་འཚེ་མ་ཡང་། འཚེ་མའི་ལྷའི་བུ་རྣམས་དང་ལྷན་ཅིག་འགྲོ་བར་སེམས་སོ།
en: Suyāma, king of the gods, along with the gods of Yāma, will also think of approaching them.

source: །ལྷའི་རྒྱལ་པོ་རབ་དགའ་ལྡན་ཡང་། དགའ་ལྡན་གྱི་ལྷའི་བུ་རྣམས་དང་ལྷན་ཅིག་འགྲོ་བར་སེམས་སོ།
en: Saṃtuṣita, king of the gods, along with the gods of Tuṣita, will also think of approaching them.

source: །ལྷའི་རྒྱལ་པོ་རབ་འཕྲུལ་དགའ་ཡང་། འཕྲུལ་དགའི་ལྷའི་བུ་རྣམས་དང་ལྷན་ཅིག་འགྲོ་བར་སེམས་སོ།
en: Sunirmita, king of the gods, along with the gods of Nirmāṇarata, will also think of approaching them.

source: །ལྷའི་རྒྱལ་པོ་དབང་བསྒྱུར་ཡང་གཞན་འཕྲུལ་དབང་བྱེད་ཀྱི་ལྷའི་བུ་རྣམས་དང་ལྷན་ཅིག་འགྲོ་བར་སེམས་སོ།
en: Vaśavartin, king of the gods, along with the gods of Para­nirmita­vaśa­vartin, will also think of approaching them.

source: །ཚངས་པ་མི་མཇེད་ཀྱི་བདག་པོ་ཡང་། ཚངས་རིས་ཀྱི་ལྷའི་བུ་རྣམས་དང་ལྷན་ཅིག་འགྲོ་བར་སེམས་སོ། །ཀུན་སྣང་དང་བའི་ལྷ་རྣམས་ཀྱང་ཉེ་བར་འདོང་བར་སེམས་སོ།
en: Brahmā Sahāṃpati, accompanied by the gods of Brahmakāyika, will also think of approaching them. {

source: །དགེ་རྒྱས་དང་།
en: Ki.

source: འབྲས་བུ་ཆེ་བ་དང་།
en: V: 22} The gods of the Ābhāsvara realms will also think of approaching them.

source: མི་ཆེ་བ་དང་། མི་གདུང་བ་དང་། ཤིན་ཏུ་མཐོང་བ་དང་། གྱ་ནོམ་སྣང་བ་དང་། གནས་གཙང་མའི་རིས་ཀྱི་ལྷ་རྣམས་ཀྱང་ཉེ་བར་འདོང་བར་སེམས་སོ།
en: The gods of Śubhakṛtsna, Bṛhatphala, Avṛha, Atapa, Sudṛśa, Sudarśana, and the Pure Abode [of Akaniṣṭha] will also think of approaching them. “

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་སྤྱོད་པ་དེ་ནི། དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་ཀྱང་རྟག་ཏུ་དགོངས་པ་ཡིན་ཏེ།
en: The tathāgatas will always direct their enlightened intention toward bodhisattva great beings who practice this profound perfection of wisdom.

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་དེ་ལྟར་སྤྱོད་པ་དེའི་ལུས་ལ་ནི་འཇིག་རྟེན་པའི་སྡུག་བསྔལ་གཞན་གྱིས་གནོད་པར་བྱས་པ་གང་ཇི་སྙེད་ཅིག་ལུས་ལ་འབྱུང་བ་དེ་དག་ཀྱང་། ཐམས་ཅད་དུ་ཐམས་ཅད་ལུས་ལ་མི་འབྱུང་མི་འབབ་སྟེ།
en: The bodies of those bodhisattva great beings who practice this profound perfection of wisdom accordingly will be entirely and in all respects unafflicted by all the many other worldly sufferings that might afflict them.

source: དགེ་སློང་དེ་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་སྤྱོད་པའི་ཚེ། འདིའི་ཡོན་ཏན་དུ་འགྱུར་བ་སྟེ།
en: O monk, such will be the manifest attributes of this life when bodhisattva great beings practice this profound perfection of wisdom.

source: འདུས་པའི་ནད་རྣམས་གང་ཇི་སྙེད་པ་འདི་ལྟ་སྟེ། མིག་གི་ནད་དམ། རྣ་བའི་ནད་དམ། སྣའི་ནད་དམ། ལྕེའི་ནད་དམ། ལུས་ཀྱི་ནད་དམ། སྙིང་གི་ནད་གང་ཇི་སྙེད་པ་དེ་དག་ཐམས་ཅད་ཀྱང་།
en: All the combined humoral disorders, as many as there are, including eye diseases, ear diseases, nose diseases, tongue diseases, body diseases, or heart diseases will not arise and will not afflict their bodies.

source: ལུས་ལ་མི་འབྱུང་མི་འབབ་སྟེ་འདི་དག་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་སྤྱོད་པའི་ཚེ། འདིའི་ཡོན་ཏན་དུ་རིག་པར་བྱའོ།
en: One should know that these are the attributes of this life when bodhisattva great beings practice the profound perfection of wisdom.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་དགའ་བོ་འདི་སྙམ་དུ་གྱུར་ཏེ། ལྷའི་དབང་པོ་བརྒྱ་བྱིན་འདི་རང་གི་སྤོབས་པས་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོན་ཅིང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཡོན་ཏན་དང་། ལེགས་པ་བརྗོད་དམ། འོན་ཏེ་སངས་རྒྱས་ཀྱི་མཐུས་སྟོན་སྙམ་པ་དང་།
en: Then the venerable Ānanda thought, “Does this Śakra, mighty lord of the gods, teach the perfection of wisdom and eloquently declare the attributes of the perfection of wisdom through his own inspired speech, or does he teach through the power of the buddhas?”

source: དེ་ནས་ལྷའི་དབང་པོ་བརྒྱ་བྱིན་གྱིས་ཚེ་དང་ལྡན་པ་དགའ་བོའི་སེམས་ཀྱི་ཡོངས་སུ་རྟོག་པ་སེམས་ཀྱིས་ཡོངས་སུ་ཤེས་ནས། ཚེ་དང་ལྡན་པ་དགའ་བོ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །བཙུན་པ་དགའ་བོ་བདག་དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ཡོན་ཏན་དང་ལེགས་པ་བརྗོད་པ་ནི་སངས་རྒྱས་ཀྱི་མཐུར་རིག་པར་བྱའོ།
en: Thereupon, Śakra, mighty lord of the gods, understood with his own mind the thoughts in the mind of the venerable Ānanda, and said to the venerable Ānanda, “Venerable Ānanda, you should know that it is by the power of the buddhas that I teach the perfection of wisdom in that manner and eloquently declare the attributes of the perfection of wisdom.”

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས། ཚེ་དང་ལྡན་པ་དགའ་བོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །དགའ་བོ་དེ་དེ་བཞིན་ནོ།
en: Then the Blessed One said to the venerable Ānanda, “Ānanda, it is so!

source: ལྷའི་དབང་པོ་བརྒྱ་བྱིན་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཟབ་མོ་འདི་སྟོན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་འདིའི་ཡོན་ཏན་དང་ལེགས་པ་བརྗོད་པ་དེ་ནི་དེ་བཞིན་གཤེགས་པའི་མཐུའོ།
en: It is by the power of the buddhas that Śakra, mighty lord of the gods, teaches this perfection of wisdom and eloquently declares the attributes of the perfection of wisdom.

source: །དགའ་བོ་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སློབ་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་བརྩོན་པར་བྱེད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྒོམ་པ་དེའི་ཚེ། གང་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན། བདུད་སྡིག་ཏོ་ཅན་གང་ཇི་སྙེད་ཅིག་ཡོད་པ་དེ་དག་ཐམས་ཅད་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་ཡང་དག་པའི་མཐའ་མངོན་ཏུ་བྱས་ཏེ།
en: Ānanda, when bodhisattva great beings train in the perfection of wisdom, persevere in the perfection of wisdom, and cultivate the perfection of wisdom, all the forces of evil Māra in the world system of the great trichiliocosm, as many as there are, will have their doubts, wondering whether these bodhisattva great beings {Ki.

source: རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་ཐོབ་པར་འགྱུར་རམ།
en: V: 23} will actualize the very limit of reality and attain the fruit of entering the stream to nirvāṇa, the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, or individual enlightenment, or if not, will they attain consummate buddhahood in unsurpassed, complete enlightenment. “

source: འོན་ཏེ་མ་ཡིན་གྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར་སྙམ་སྟེ། དོགས་པ་རྙེད་པར་འགྱུར་རོ། །དགའ་བོ་གཞན་ཡང་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་མ་བྲལ་བར་གྱུར་པ་དེའི་ཚེ། བདུད་སྡིག་ཏོ་ཅན་མྱ་ངན་གྱི་ཟུག་རྔུས་ཟུག་པར་འགྱུར་རོ།
en: Moreover, Ānanda, at the time when bodhisattva great beings do not lack the perfection of wisdom, the evil Māra will be pierced by the pains of sorrow.

source: །དགའ་བོ་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། བདུད་སྡིག་ཏོ་ཅན་ཅི་ནས་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འདི་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཡིད་ལ་བྱེད་པས། སེམས་གཅིག་ཙམ་འཁྲུགས་པར་འགྱུར་བ་དང་། ཞུམ་པར་འགྱུར་བ་དང་། སྤུ་གཡོ་བར་འགྱུར་བར་སྐར་མ་ལྟུང་བ་གཏོང་ཞིང་འཇིགས་པ་སྐྱེད་དོ།
en: Also, Ānanda, at the time when bodhisattva great beings practice the perfection of wisdom, the evil Māra will by all means cause meteors to fall and arouse fear, so that at least a single thought of these bodhisattva great beings might be disturbed from their attention to all-aspect omniscience, that they might be discouraged, and that their hairs might stand on end.”

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་དགའ་བོས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཅི་ལགས། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐམས་ཅད་ཀྱི་དྲུང་དུ་བདུད་སྡིག་ཏོ་ཅན་གཙེ་བའི་བསམ་པས་མཆི་བར་འགྱུར་རམ། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Then the venerable Ānanda asked the Blessed One, “Blessed Lord, does the evil Māra approach all bodhisattva great beings with the intention of harming them?” “

source: དགའ་བོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐམས་ཅད་ཀྱི་དྲུང་དུ་བདུད་སྡིག་ཏོ་ཅན་གཙེ་བའི་བསམ་པས་འོང་བ་མ་ཡིན་ནོ། །དགའ་བོས་གསོལ་པ།
en: Ānanda, the evil Māra does not approach all bodhisattva great beings with the intention of harming them,” replied the Blessed One. “
